package com.qinggan.app.arielapp.minor.main.navigation.poisearch;

import android.text.TextUtils;

import org.json.JSONArray;
import org.json.JSONException;
import org.json.JSONObject;

public class SearchType {

    private static String typeString = "-美食-中餐厅-外国餐厅-小吃快餐店-蛋糕甜品店-咖啡厅-茶座-酒吧-酒店-星级酒店-快捷酒店-公寓式酒店-购物-购物中心-百货商场-超市-便利店-家具建材-家电数码-商铺-集市-生活服务-通讯营业厅-邮局-物流公司-售票处-洗衣店-图文快印店-照相馆-房产中介机构-公用事业-维修点-家政服务-殡葬服务-彩票销售点-宠物服务-报刊亭-厕所-公共厕所-丽人-美容-美发-美甲-美体-旅游景点-公园-动物园-植物园-游乐园-博物馆-水族馆-海滨浴场-文物古迹-教堂-风景区-休闲娱乐-度假村-农家院-电影院-KTV-剧院-歌舞厅-网吧-游戏场所-洗浴按摩-休闲广场-运动健身-体育场馆-极限运动场所-健身中心-教育培训-高等院校-中学-小学-幼儿园-成人教育-亲子教育-特殊教育学校-留学中介机构-科研机构-培训机构-图书馆-科技馆-文化传媒-新闻出版-广播电视-艺术团体-美术馆-展览馆-文化宫-医疗-综合医院-专科医院-诊所-药店-体检机构-疗养院-急救中心-疾控中心-汽车服务-汽车销售-汽车维修-汽车美容-汽车配件-汽车租赁-汽车检测场-交通设施-飞机场-火车站-地铁站-长途汽车站-公交车站-港口-停车场-加油站--加油加气站-服务区-收费站-桥-充电站-路侧停车位-金融-银行-ATM-信用社-投资理财-典当行-房地产-写字楼-住宅区-宿舍-";

    private static String typeStringJson = "[\n" +
            "  {\n" +
            "    \"name\": \"美食\",\n" +
            "    \"code\": 256,\n" +
            "    \"subTypes\": [\n" +
            "      {\n" +
            "        \"name\": \"中餐厅\",\n" +
            "        \"code\": 257\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"外国餐厅\",\n" +
            "        \"code\": 258\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"小吃快餐店\",\n" +
            "        \"code\": 259\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"蛋糕甜品店\",\n" +
            "        \"code\": 260\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"咖啡厅\",\n" +
            "        \"code\": 261\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"茶座\",\n" +
            "        \"code\": 262\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"酒吧\",\n" +
            "        \"code\": 257\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"酒店\",\n" +
            "    \"code\": 512,\n" +
            "    \"subTypes\": [\n" +
            "      {\n" +
            "        \"name\": \"星级酒店\",\n" +
            "        \"code\": 513\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"快捷酒店\",\n" +
            "        \"code\": 514\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"公寓式酒店\",\n" +
            "        \"code\": 515\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"购物\",\n" +
            "    \"code\": 768,\n" +
            "    \"subTypes\": [\n" +
            "      {\n" +
            "        \"name\": \"购物中心\",\n" +
            "        \"code\": 769\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"百货商场\",\n" +
            "        \"code\": 770\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"超市\",\n" +
            "        \"code\": 771\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"便利店\",\n" +
            "        \"code\": 772\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"家具建材\",\n" +
            "        \"code\": 773\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"家电数码\",\n" +
            "        \"code\": 774\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"商铺\",\n" +
            "        \"code\": 775\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"集市\",\n" +
            "        \"code\": 776\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"生活服务\",\n" +
            "    \"code\": 1024,\n" +
            "    \"subTypes\": [\n" +
            "      {\n" +
            "        \"name\": \"通讯营业厅\",\n" +
            "        \"code\": 1025\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"邮局\",\n" +
            "        \"code\": 1026\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"物流公司\",\n" +
            "        \"code\": 1027\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"售票处\",\n" +
            "        \"code\": 1028\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"洗衣店\",\n" +
            "        \"code\": 1029\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"图文快印店\",\n" +
            "        \"code\": 1030\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"照相馆\",\n" +
            "        \"code\": 1031\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"房产中介机构\",\n" +
            "        \"code\": 1032\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"公用事业\",\n" +
            "        \"code\": 1033\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"维修点\",\n" +
            "        \"code\": 1034\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"家政服务\",\n" +
            "        \"code\": 1035\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"殡葬服务\",\n" +
            "        \"code\": 1036\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"彩票销售点\",\n" +
            "        \"code\": 1037\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"宠物服务\",\n" +
            "        \"code\": 1038\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"报刊亭\",\n" +
            "        \"code\": 1039\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"公共厕所\",\n" +
            "        \"code\": 1040\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"丽人\",\n" +
            "    \"code\": 1280,\n" +
            "    \"subTypes\": [\n" +
            "      {\n" +
            "        \"name\": \"美容\",\n" +
            "        \"code\": 1281\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"美发\",\n" +
            "        \"code\": 1282\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"美甲\",\n" +
            "        \"code\": 1283\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"美体\",\n" +
            "        \"code\": 1284\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"旅游景点\",\n" +
            "    \"code\": 1536,\n" +
            "    \"subTypes\": [\n" +
            "      {\n" +
            "        \"name\": \"公园\",\n" +
            "        \"code\": 1537\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"动物园\",\n" +
            "        \"code\": 1538\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"植物园\",\n" +
            "        \"code\": 1539\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"游乐园\",\n" +
            "        \"code\": 1540\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"博物馆\",\n" +
            "        \"code\": 1541\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"水族馆\",\n" +
            "        \"code\": 1542\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"海滨浴场\",\n" +
            "        \"code\": 1543\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"文物古迹\",\n" +
            "        \"code\": 1544\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"教堂\",\n" +
            "        \"code\": 1545\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"风景区\",\n" +
            "        \"code\": 1546\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"休闲娱乐\",\n" +
            "    \"code\": 1792,\n" +
            "    \"subTypes\": [\n" +
            "      {\n" +
            "        \"name\": \"度假村\",\n" +
            "        \"code\": 1793\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"农家院\",\n" +
            "        \"code\": 1794\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"电影院\",\n" +
            "        \"code\": 1795\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"KTV\",\n" +
            "        \"code\": 1796\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"剧院\",\n" +
            "        \"code\": 1797\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"歌舞厅\",\n" +
            "        \"code\": 1798\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"网吧\",\n" +
            "        \"code\": 1799\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"游戏场所\",\n" +
            "        \"code\": 1800\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"洗浴按摩\",\n" +
            "        \"code\": 1801\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"休闲广场\",\n" +
            "        \"code\": 1802\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"运动健身\",\n" +
            "    \"code\": 2048,\n" +
            "    \"subTypes\": [\n" +
            "      {\n" +
            "        \"name\": \"体育场馆\",\n" +
            "        \"code\": 2049\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"极限运动场所\",\n" +
            "        \"code\": 2050\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"健身中心\",\n" +
            "        \"code\": 2051\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"教育培训\",\n" +
            "    \"code\": 2304,\n" +
            "    \"subTypes\": [\n" +
            "      {\n" +
            "        \"name\": \"高等院校\",\n" +
            "        \"code\": 2305\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"中学\",\n" +
            "        \"code\": 2306\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"小学\",\n" +
            "        \"code\": 2307\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"幼儿园\",\n" +
            "        \"code\": 2308\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"成人教育\",\n" +
            "        \"code\": 2309\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"亲子教育\",\n" +
            "        \"code\": 2310\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"特殊教育学校\",\n" +
            "        \"code\": 2311\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"留学中介机构\",\n" +
            "        \"code\": 2312\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"科研机构\",\n" +
            "        \"code\": 2313\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"培训机构\",\n" +
            "        \"code\": 2314\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"图书馆\",\n" +
            "        \"code\": 2315\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"科技馆\",\n" +
            "        \"code\": 2316\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"文化传媒\",\n" +
            "    \"code\": 2560,\n" +
            "    \"subTypes\": [\n" +
            "      {\n" +
            "        \"name\": \"新闻出版\",\n" +
            "        \"code\": 2561\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"广播电视\",\n" +
            "        \"code\": 2562\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"艺术团体\",\n" +
            "        \"code\": 2563\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"美术馆\",\n" +
            "        \"code\": 2564\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"展览馆\",\n" +
            "        \"code\": 2565\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"文化宫\",\n" +
            "        \"code\": 2566\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"医疗\",\n" +
            "    \"code\": 2816,\n" +
            "    \"subTypes\": [\n" +
            "      {\n" +
            "        \"name\": \"综合医院\",\n" +
            "        \"code\": 2817\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"专科医院\",\n" +
            "        \"code\": 2818\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"诊所\",\n" +
            "        \"code\": 2819\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"药店\",\n" +
            "        \"code\": 2820\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"体检机构\",\n" +
            "        \"code\": 2821\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"疗养院\",\n" +
            "        \"code\": 2822\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"急救中心\",\n" +
            "        \"code\": 2823\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"疾控中心\",\n" +
            "        \"code\": 2824\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"汽车服务\",\n" +
            "    \"code\": 3072,\n" +
            "    \"subTypes\": [\n" +
            "      {\n" +
            "        \"name\": \"汽车销售\",\n" +
            "        \"code\": 3073\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"汽车维修\",\n" +
            "        \"code\": 3074\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"汽车美容\",\n" +
            "        \"code\": 3075\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"汽车配件\",\n" +
            "        \"code\": 3076\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"汽车租赁\",\n" +
            "        \"code\": 3077\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"汽车检测场\",\n" +
            "        \"code\": 3078\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"交通设施\",\n" +
            "    \"code\": 3328,\n" +
            "    \"subTypes\": [\n" +
            "      {\n" +
            "        \"name\": \"飞机场\",\n" +
            "        \"code\": 3329\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"火车站\",\n" +
            "        \"code\": 3330\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"地铁站\",\n" +
            "        \"code\": 3331\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"长途汽车站\",\n" +
            "        \"code\": 3332\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"公交车站\",\n" +
            "        \"code\": 3333\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"港口\",\n" +
            "        \"code\": 3334\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"停车场\",\n" +
            "        \"code\": 3335\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"加油加气站\",\n" +
            "        \"code\": 3336\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"服务区\",\n" +
            "        \"code\": 3337\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"收费站\",\n" +
            "        \"code\": 3338\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"桥\",\n" +
            "        \"code\": 3339\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"充电站\",\n" +
            "        \"code\": 3340\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"路侧停车位\",\n" +
            "        \"code\": 3341\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"金融\",\n" +
            "    \"code\": 3584,\n" +
            "    \"subTypes\": [\n" +
            "      {\n" +
            "        \"name\": \"银行\",\n" +
            "        \"code\": 3585\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"ATM\",\n" +
            "        \"code\": 3586\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"信用社\",\n" +
            "        \"code\": 3587\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"投资理财\",\n" +
            "        \"code\": 3588\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"典当行\",\n" +
            "        \"code\": 3589\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"房地产\",\n" +
            "    \"code\": 3840,\n" +
            "    \"subTypes\": [\n" +
            "      {\n" +
            "        \"name\": \"写字楼\",\n" +
            "        \"code\": 3841\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"住宅区\",\n" +
            "        \"code\": 3842\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"宿舍\",\n" +
            "        \"code\": 3843\n" +
            "      }\n" +
            "    ]\n" +
            "  }\n" +
            "]";

    public static void formatstr() {
        try {
            StringBuffer stringBuffer = new StringBuffer("-");
            JSONArray jsonArrRoot = new JSONArray(typeStringJson);
            for (int i = 0; i < jsonArrRoot.length(); ++i) {
                JSONObject jsonObjL1 = jsonArrRoot.getJSONObject(i);
                String name = jsonObjL1.optString("name");
                if (!TextUtils.isEmpty(name)) {
                    stringBuffer.append(name);
                    stringBuffer.append("-");
                }

                JSONArray jsonArrSub = jsonObjL1.optJSONArray("subTypes");
                if (jsonArrSub != null) {
                    for (int j = 0; j < jsonArrSub.length(); ++j) {
                        JSONObject jsonObjL2 = jsonArrSub.getJSONObject(j);
                        String sub_name = jsonObjL2.optString("name");
                        if (!TextUtils.isEmpty(sub_name)) {
                            stringBuffer.append(sub_name);
                            stringBuffer.append("-");
                        }
                    }
                }
            }

            String result = stringBuffer.toString();
        } catch (JSONException e) {
            e.printStackTrace();
        }
    }

    public static boolean isType(String tpye) {
        if ("".equals(tpye)) {
            return false;
        }
        return typeString.contains("-" + tpye + "-");
    }
}
